In [1]:
import pandas as pd

In [2]:
actor=pd.read_csv('../data/actor.csv')
category=pd.read_csv('../data/category.csv')
film=pd.read_csv('../data/film.csv')
inventory=pd.read_csv('../data/inventory.csv')
language=pd.read_csv('../data/language.csv')
old_HDD=pd.read_csv('../data/old_HDD.csv')
rental=pd.read_csv('../data/rental.csv')

# Limpieza columna actor

In [4]:
nan_cols = actor.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [5]:
actor.last_update.value_counts()

2006-02-15 04:34:33    200
Name: last_update, dtype: int64

In [6]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
actor = actor.drop(['last_update'], axis=1)

In [30]:
actor.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

# Limpieza columna category

In [8]:
nan_cols = category.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [9]:
category.last_update.value_counts()

2006-02-15 04:46:27    16
Name: last_update, dtype: int64

In [10]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
category = category.drop(['last_update'], axis=1)

In [31]:
category.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

# Limpieza columna film

In [12]:
nan_cols = film.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

original_language_id    100.0
dtype: float64

In [13]:
#eliminamos la columna de 'original_language_id' ya que está llena de nulos
film = film.drop(['original_language_id'], axis=1)

In [14]:
film.release_year.value_counts()

2006    1000
Name: release_year, dtype: int64

In [15]:
film.last_update.value_counts()

2006-02-15 05:03:42    1000
Name: last_update, dtype: int64

In [16]:
#eliminamos la columna de 'release_year' ya que todas las películas son del 2006.
film = film.drop(['release_year'], axis=1)

In [17]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
film = film.drop(['last_update'], axis=1)

In [32]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes

# Limpieza columna inventory

In [19]:
nan_cols = inventory.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [20]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
inventory = inventory.drop(['last_update'], axis=1)

In [33]:
inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

# Limpieza columna language

In [22]:
nan_cols = language.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [23]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
language = language.drop(['last_update'], axis=1)

In [34]:
language.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

# Limpieza columna old_HDD

In [25]:
nan_cols = old_HDD.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [26]:
#eliminamos la columna de 'release_year' ya que todas son del mismo año
old_HDD = old_HDD.drop(['release_year'], axis=1)

In [35]:
old_HDD.head()

  first_name last_name                  title  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS            2
2   PENELOPE   GUINESS            ANGELS LIFE           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS           10
4   PENELOPE   GUINESS          CHEAPER CLYDE           14

# Limpieza columna rental

In [28]:
nan_cols = rental.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [29]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
rental = rental.drop(['last_update'], axis=1)

In [37]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1